In [14]:
import pymongo
import time
import pandas as pd

In [15]:
conn = 'mongodb://root:ucbmongodb@35.184.4.63:27017'
client = pymongo.MongoClient(conn)
db = client.ACS

In [18]:
censusdf=pd.read_csv('../static/data/final_w_lat_lon.csv')
censusdf.head()

,Unnamed: 0,County,2016IN,2016OUT,2016NET,2015IN,2015OUT,2015NET,2014IN,2014OUT,...,2012MED_INC,2012RENT,2011MED_INC,2011RENT,2010MED_INC,2010RENT,2009MED_INC,2009RENT,Lat,Lon
0,0,Alameda,113013,93326,-167,108017,89267,960,103183,87176,...,71516,1265,70821,1228,69384,1188,68863,1166,37.716662,–122.096151
1,1,Alpine,160,110,42,183,253,-82,165,267,...,59931,755,59018,796,63478,913,54605,820,38.632506,–119.888663
2,2,Amador,3724,2868,806,3493,2700,724,2896,2203,...,53462,1039,56180,1011,54758,1059,57347,1075,38.428879,–120.715248
3,3,Butte,14982,12840,1433,13463,12349,339,13296,12073,...,43339,885,42971,878,43170,861,42002,843,39.648354,–121.646310
4,4,Calaveras,2393,2583,-243,2148,2452,-353,2023,2087,...,54686,1043,55256,1031,54971,948,57676,920,38.167573,–120.557245

In [25]:
censusdf['Lon'] = censusdf['Lon'].str.replace('–','-').astype('float64', copy=False)
censusdf.head()

,Unnamed: 0,County,2016IN,2016OUT,2016NET,2015IN,2015OUT,2015NET,2014IN,2014OUT,...,2012MED_INC,2012RENT,2011MED_INC,2011RENT,2010MED_INC,2010RENT,2009MED_INC,2009RENT,Lat,Lon
0,0,Alameda,113013,93326,-167,108017,89267,960,103183,87176,...,71516,1265,70821,1228,69384,1188,68863,1166,37.716662,-122.096151
1,1,Alpine,160,110,42,183,253,-82,165,267,...,59931,755,59018,796,63478,913,54605,820,38.632506,-119.888663
2,2,Amador,3724,2868,806,3493,2700,724,2896,2203,...,53462,1039,56180,1011,54758,1059,57347,1075,38.428879,-120.715248
3,3,Butte,14982,12840,1433,13463,12349,339,13296,12073,...,43339,885,42971,878,43170,861,42002,843,39.648354,-121.646310
4,4,Calaveras,2393,2583,-243,2148,2452,-353,2023,2087,...,54686,1043,55256,1031,54971,948,57676,920,38.167573,-120.557245

In [26]:
# pd.to_numeric(censusdf['Lon'])
censusdf.dtypes

Unnamed: 0       int64
County          object
2016IN           int64
2016OUT          int64
2016NET          int64
2015IN           int64
2015OUT          int64
2015NET          int64
2014IN           int64
2014OUT          int64
2014NET          int64
2013IN           int64
2013OUT          int64
2013NET          int64
2012IN           int64
2012OUT          int64
2012NET          int64
2011IN           int64
2011OUT          int64
2011NET          int64
2010IN           int64
2010OUT          int64
2010NET          int64
2009IN           int64
2009OUT          int64
2009NET          int64
NAME            object
2016MED_INC      int64
2016RENT         int64
2015MED_INC      int64
2015RENT       float64
2014MED_INC      int64
2014RENT         int64
2013MED_INC      int64
2013RENT         int64
2012MED_INC      int64
2012RENT         int64
2011MED_INC      int64
2011RENT         int64
2010MED_INC      int64
2010RENT         int64
2009MED_INC      int64
2009RENT         int64
Lat            float64
Lon            float64
dtype: object

In [27]:
db.census_by_county.insert_many(censusdf.to_dict('records'))